results-petclinic-harness_2_0_0-jvm-shenandoah-run/result-2026-01-05-22:47:33/wrk2_results_20260105_224742.txt
Running 30s test @ http://petclinic:8006
  16 threads and 16 connections
  Thread calibration: mean lat.: 2100.283ms, rate sampling interval: 4734ms
  Thread calibration: mean lat.: 2262.591ms, rate sampling interval: 5091ms
  Thread calibration: mean lat.: 2122.911ms, rate sampling interval: 4976ms
  Thread calibration: mean lat.: 2209.438ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 2083.362ms, rate sampling interval: 4710ms
  Thread calibration: mean lat.: 2098.154ms, rate sampling interval: 4800ms
  Thread calibration: mean lat.: 2154.922ms, rate sampling interval: 4902ms
  Thread calibration: mean lat.: 1897.148ms, rate sampling interval: 4648ms
  Thread calibration: mean lat.: 2303.637ms, rate sampling interval: 5271ms
  Thread calibration: mean lat.: 1898.703ms, rate sampling interval: 4431ms
  Thread calibration: mean lat.: 2251.138ms, rate sampling interval: 5021ms
  Thread calibration: mean lat.: 2086.063ms, rate sampling interval: 4796ms
  Thread calibration: mean lat.: 2113.315ms, rate sampling interval: 4964ms
  Thread calibration: mean lat.: 1871.939ms, rate sampling interval: 4259ms
  Thread calibration: mean lat.: 1848.027ms, rate sampling interval: 4276ms
  Thread calibration: mean lat.: 1879.257ms, rate sampling interval: 4362ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   361.41ms  628.33ms   2.47s    80.90%
    Req/Sec   207.63     31.50   275.00     72.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.07ms
 75.000%  551.42ms
 90.000%    1.51s 
 99.000%    2.14s 
 99.900%    2.42s 
 99.990%    2.46s 
 99.999%    2.47s 
100.000%    2.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.548     0.000000            1         1.00
       1.091     0.100000         6556         1.11
       1.328     0.200000        13110         1.25
       1.535     0.300000        19668         1.43
       1.738     0.400000        26204         1.67
       2.065     0.500000        32761         2.00
       2.379     0.550000        36042         2.22
       2.907     0.600000        39315         2.50
       4.279     0.650000        42582         2.86
     106.623     0.700000        45858         3.33
     551.423     0.750000        49136         4.00
     741.887     0.775000        50775         4.44
     928.255     0.800000        52408         5.00
    1087.487     0.825000        54053         5.71
    1244.159     0.850000        55688         6.67
    1390.591     0.875000        57329         8.00
    1451.007     0.887500        58153         8.89
    1514.495     0.900000        58960        10.00
    1568.767     0.912500        59789        11.43
    1628.159     0.925000        60610        13.33
    1697.791     0.937500        61427        16.00
    1730.559     0.943750        61828        17.78
    1765.375     0.950000        62245        20.00
    1798.143     0.956250        62652        22.86
    1858.559     0.962500        63064        26.67
    1926.143     0.968750        63468        32.00
    1944.575     0.971875        63675        35.56
    1973.247     0.975000        63882        40.00
    1997.823     0.978125        64077        45.71
    2033.663     0.981250        64282        53.33
    2066.431     0.984375        64487        64.00
    2084.863     0.985938        64589        71.11
    2117.631     0.987500        64696        80.00
    2129.919     0.989062        64795        91.43
    2142.207     0.990625        64915       106.67
    2154.495     0.992188        65002       128.00
    2160.639     0.992969        65056       142.22
    2168.831     0.993750        65108       160.00
    2203.647     0.994531        65152       182.86
    2295.807     0.995313        65203       213.33
    2314.239     0.996094        65260       256.00
    2322.431     0.996484        65282       284.44
    2357.247     0.996875        65307       320.00
    2375.679     0.997266        65331       365.71
    2392.063     0.997656        65363       426.67
    2400.255     0.998047        65384       512.00
    2404.351     0.998242        65396       568.89
    2410.495     0.998437        65408       640.00
    2416.639     0.998633        65424       731.43
    2418.687     0.998828        65434       853.33
    2424.831     0.999023        65447      1024.00
    2428.927     0.999121        65456      1137.78
    2430.975     0.999219        65460      1280.00
    2435.071     0.999316        65466      1462.86
    2437.119     0.999414        65472      1706.67
    2439.167     0.999512        65479      2048.00
    2441.215     0.999561        65482      2275.56
    2443.263     0.999609        65488      2560.00
    2443.263     0.999658        65488      2925.71
    2447.359     0.999707        65494      3413.33
    2449.407     0.999756        65495      4096.00
    2451.455     0.999780        65497      4551.11
    2455.551     0.999805        65498      5120.00
    2459.647     0.999829        65499      5851.43
    2463.743     0.999854        65503      6826.67
    2463.743     0.999878        65503      8192.00
    2463.743     0.999890        65503      9102.22
    2467.839     0.999902        65506     10240.00
    2467.839     0.999915        65506     11702.86
    2467.839     0.999927        65506     13653.33
    2471.935     0.999939        65507     16384.00
    2471.935     0.999945        65507     18204.44
    2471.935     0.999951        65507     20480.00
    2473.983     0.999957        65509     23405.71
    2473.983     0.999963        65509     27306.67
    2473.983     0.999969        65509     32768.00
    2473.983     0.999973        65509     36408.89
    2473.983     0.999976        65509     40960.00
    2473.983     0.999979        65509     46811.43
    2473.983     0.999982        65509     54613.33
    2476.031     0.999985        65510     65536.00
    2476.031     1.000000        65510          inf
#[Mean    =      361.409, StdDeviation   =      628.331]
#[Max     =     2473.984, Total count    =        65510]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89723 requests in 29.73s, 12.07MB read
Requests/sec:   3018.23
Transfer/sec:    415.79KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 89723
Total errors (4xx/5xx): 0
Threads aggregated: 16

Status code distribution:
  302:    89723 (100.00%) ██████████████████████████████████████████████████

Histogram data written to: /wrktemp/results/response_histogram.json